math/teory.org
#+TITLE: Матан. Подготвка к экзамену.
#+latex_header: \usepackage[utf8x]{inputenc}
#+latex_header: \usepackage[T2A]{fontenc}
#+latex_header: \usepackage[colorlinks=true, linkcolor=Maroon, urlcolor=Maroon]{hyperref}
* Даты
** Консультация 
/2021-06-24 Thu/
** Экзамен 
/2021-06-25 Fri/

* Темы
** Первообразная и неопределенный интеграл (определения). Свойства интеграла. Таблица основных неопределенных интегралов. Формула замены переменной в неопределенном интеграле (с доказательством). Формула интегрирования по частям.

*** Опр. 1. 
Функция /F/ называется первообразной функции /f/ на промежутке \Delta , если /F/ дифференцируема на \Delta и в каждой точке /x/ \in \Delta
\begin{eqnarray}
&&F'(x)=f(x)&&
\end{eqnarray}
Очевидно, что первообразная /F(x)/ непрерывна на \Delta.

*** Опр. 2.  
Пусть функция /f(x)/ задана на промежутке \Delta. Совокупность всех ее первообразных на этом промежутке называется /*неопределенным интегралом от функции /f/*/ и обозначается

\begin{eqnarray}
\int&f(x)&dx
\end{eqnarray}

Если /F(x)/ — какая-либо первообразная функции /f(x)/ на /Delta, то пишут

\begin{eqnarray}
$$\int&f(x)&dx=&F(x)&+C$$
\end{eqnarray}

/C/ — произвольная постоянная.

*** Основные свойства интеграла 

