math/teory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-18 Fri 22:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Матан. Подготвка к экзамену.</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="q" />
</head>
<body>
<div id="content">
<h1 class="title">Матан. Подготвка к экзамену.</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org83fcd22">1. Даты</a>
<ul>
<li><a href="#org91052a4">1.1. Консультация</a></li>
<li><a href="#org143c91a">1.2. Экзамен</a></li>
</ul>
</li>
<li><a href="#orgfcad356">2. Темы</a>
<ul>
<li><a href="#org39846db">2.1. Первообразная и неопределенный интеграл (определения). Свойства интеграла. Таблица основных неопределенных интегралов. Формула замены переменной в неопределенном интеграле (с доказательством). Формула интегрирования по частям.</a>
<ul>
<li><a href="#org199cefb">2.1.1. Опр. 1.</a></li>
<li><a href="#orga9c7e65">2.1.2. Опр. 2.</a></li>
<li><a href="#orgad895b8">2.1.3. Основные свойства интеграла</a></li>
<li><a href="#orgf6e665a">2.1.4. След. 1 (Линейность интеграла)</a></li>
</ul>
</li>
<li><a href="#orgcdeba72">2.2. Определенный интеграл Римана (определение). Ограниченность интегрируемых функций (с доказательством). Верхние и нижние суммы Дарбу (определения). Верхний и нижний интегралы Дарбу (определения). Критерий Дарбу. Интегрируемость непрерывных функций. Интегрируемость монотонных функций.</a></li>
<li><a href="#org207082f">2.3. Свойства определенного интеграла (сформулировать все, доказать непрерывность интеграла по верхнему пределу). Интегральная теорема о среднем.</a></li>
<li><a href="#org3c51d49">2.4. Теорема о дифференцировании интеграла по верхнему пределу (с доказательством).  Теорема о существовании первообразной (с доказательством). Формула Ньютона-Лейбница (с доказательством). Формула замены переменной в определенном интеграле. Формула интегрирования по частям.</a></li>
<li><a href="#orgb64c6bc">2.5. Определение несобственных интегралов.  Формула Ньютона-Лейбница и формула замены переменной для несобственных интегралов.</a></li>
<li><a href="#org8a13bff">2.6. Несобственные интегралы от неотрицательных функций (лемма и признак сравнения). Критерий Коши сходимости интеграла (с доказательством). Абсолютно сходящиеся интегралы (определение и теорема о сходимости абсолютно сходящегося интеграла).</a></li>
<li><a href="#orgc7174f2">2.7. Определение числового ряда. Необходимый признак сходимости ряда (с доказательством). Критерий Коши сходимости ряда (с доказательством). Ряды с неотрицательными членами (признак сравнения, интегральный признак Коши, радикальный признак Коши, признак Даламбера).</a></li>
<li><a href="#org8d93aaf">2.8. Знакопеременные ряды (признак Лейбница). Абсолютно сходящиеся ряды (определение). Критерий Коши абсолютной сходимости ряда. Условно сходящиеся ряды (определение). Теорема Римана.</a></li>
<li><a href="#orgcc1fb16">2.9. Функциональные последовательности  и ряды (определения, в том числе, ограниченная последовательность, сходящаяся последовательность, сходящийся ряд, абсолютно сходящийся ряд). Равномерная сходимость функциональной последовательности и функционального ряда (определение и пример). Критерии Коши равномерной сходимости функциональной последовательности (ряда). Признак Вейерштрасса.</a></li>
<li><a href="#org9978bf4">2.10. Свойства равномерно сходящихся рядов (непрерывность суммы (с доказательством), интегрирование, дифференцирование).</a></li>
<li><a href="#org0502349">2.11. Степенные ряды (определение). Первая теорема Абеля (с доказательством). Радиус и круг (интервал) сходимости степенного ряда (определения). Понятие аналитической функции (определение). Теорема о представлении аналитической функции рядом Тейлора.</a></li>
<li><a href="#orgbdd57b5">2.12. Определение n-мерного арифметического евклидова пространства. Определение n-мерного открытого шара. Предел последовательности в n-мерном пространстве, ограниченное множество  в n-мерном пространстве, окрестность бесконечно удалённой точки (определения).</a></li>
<li><a href="#org1769065">2.13. Внутренняя точка множества, открытое множество, точка прикосновения множества, предельная точка множества, замыкание множества, замкнутое множество, компактное множество, линейно связное множество, выпуклое множество, область (определения).</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org83fcd22" class="outline-2">
<h2 id="org83fcd22"><span class="section-number-2">1</span> Даты</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org91052a4" class="outline-3">
<h3 id="org91052a4"><span class="section-number-3">1.1</span> Консультация</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<i>2021-06-24 Thu</i>
</p>
</div>
</div>
<div id="outline-container-org143c91a" class="outline-3">
<h3 id="org143c91a"><span class="section-number-3">1.2</span> Экзамен</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<i>2021-06-25 Fri</i>
</p>
</div>
</div>
</div>

<div id="outline-container-orgfcad356" class="outline-2">
<h2 id="orgfcad356"><span class="section-number-2">2</span> Темы</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org39846db" class="outline-3">
<h3 id="org39846db"><span class="section-number-3">2.1</span> Первообразная и неопределенный интеграл (определения). Свойства интеграла. Таблица основных неопределенных интегралов. Формула замены переменной в неопределенном интеграле (с доказательством). Формула интегрирования по частям.</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org199cefb" class="outline-4">
<h4 id="org199cefb"><span class="section-number-4">2.1.1</span> Опр. 1.</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Функция <i>F</i> называется первообразной функции <i>f</i> на промежутке &Delta; , если <i>F</i> дифференцируема на &Delta; и в каждой точке <i>x</i> &isin; &Delta;
</p>

\begin{eqnarray}
 &F'(x)&=&f(x)&
\end{eqnarray}

<p>
Очевидно, что первообразная <i>F(x)</i> непрерывна на &Delta;.
</p>
</div>
</div>

<div id="outline-container-orga9c7e65" class="outline-4">
<h4 id="orga9c7e65"><span class="section-number-4">2.1.2</span> Опр. 2.</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Пусть функция <i>f(x)</i> задана на промежутке &Delta;. Совокупность всех ее первообразных на этом промежутке называется <i><b>неопределенным интегралом от функции <i>f</i></b></i> и обозначается
</p>

\begin{eqnarray}
\int&f(x)&dx
\end{eqnarray}

<p>
Если <i>F(x)</i> — какая-либо первообразная функции <i>f(x)</i> на /Delta, то пишут
</p>

\begin{eqnarray}
\int&f(x)&dx=&F(x)&+C 
\end{eqnarray}

<p>
<i>C</i> — произвольная постоянная.
</p>
</div>
</div>

<div id="outline-container-orgad895b8" class="outline-4">
<h4 id="orgad895b8"><span class="section-number-4">2.1.3</span> Основные свойства интеграла</h4>
<div class="outline-text-4" id="text-2-1-3">
</div>
<ol class="org-ol">
