math/teory.tex
% Created 2021-06-19 Sat 00:46
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[utf8x]{inputenc}
\usepackage[T2A]{fontenc}
\usepackage[colorlinks=true, linkcolor=Maroon, urlcolor=Maroon]{hyperref}
\author{q}
\date{\today}
\title{Матан. Подготвка к экзамену.}
\hypersetup{
 pdfauthor={q},
 pdftitle={Матан. Подготвка к экзамену.},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Даты}
\label{sec:orgd5c1067}
\subsection{Консультация}
\label{sec:org4415650}
\emph{2021-06-24 Thu}
\subsection{Экзамен}
\label{sec:org2116e8a}
\emph{2021-06-25 Fri}

\section{Темы}
\label{sec:org647bedd}
\subsection{Первообразная и неопределенный интеграл (определения). Свойства интеграла. Таблица основных неопределенных интегралов. Формула замены переменной в неопределенном интеграле (с доказательством). Формула интегрирования по частям.}
\label{sec:org38a95bb}

\subsubsection{Опр. 1.}
\label{sec:orga7ec983}
Функция \emph{F} называется первообразной функции \emph{f} на промежутке \(\Delta\) , если \emph{F} дифференцируема на \(\Delta\) и в каждой точке \emph{x} \(\in\) \(\Delta\)
\begin{eqnarray}
&&F'(x)=f(x)&&
\end{eqnarray}
Очевидно, что первообразная \emph{F(x)} непрерывна на \(\Delta\).

\subsubsection{Опр. 2.}
\label{sec:orgc3a0fc4}
Пусть функция \emph{f(x)} задана на промежутке \(\Delta\). Совокупность всех ее первообразных на этом промежутке называется \emph{\textbf{неопределенным интегралом от функции \emph{f}}} и обозначается

\begin{eqnarray}
\int&f(x)&dx
\end{eqnarray}

Если \emph{F(x)} — какая-либо первообразная функции \emph{f(x)} на /Delta, то пишут

\begin{eqnarray}
$$\int&f(x)&dx=&F(x)&+C$$
\end{eqnarray}

\emph{C} — произвольная постоянная.

\subsubsection{Основные свойства интеграла}
\label{sec:org21e1663}

\begin{enumerate}
