math/teory.html
<li><a id="orgf79c4e1"></a>Если функция <i>F(x)</i> дифференцируема на &Delta;, то<br />
<div class="outline-text-5" id="text-2-1-3-1">
\begin{eqnarray}
\int d&F(x)&=&F(x)&+C \text{ или } \int&F'(x)&dx=&F(x)&+C
\end{eqnarray}
</div>
</li>

<li><a id="orga0f6a17"></a>Пусть функция <i>f(x)</i> имеет первообразную на &Delta;. Тогда для любого <i>x</i> &isin; &Delta; имеет место равенство:<br />
<div class="outline-text-5" id="text-2-1-3-2">
\begin{eqnarray}
d\int&f(x)&=&f(x)&dx
\end{eqnarray}
</div>
</li>

<li><a id="org0a135be"></a>Если функции <i>f<sub>1</sub></i>, <i>f<sub>2</sub></i> имеют первообразные на &Delta;, то функция <i>f<sub>1</sub></i> + <i>f<sub>2</sub></i> имеет первообразную на &Delta;, причем:<br />
<div class="outline-text-5" id="text-2-1-3-3">
\begin{eqnarray}
\int(&f_1(x)& + &f_2(x)&)dx=\int&f_1(x)&dx + \int&f_2(x)&dx
\end{eqnarray}
</div>
</li>

<li><a id="org492477b"></a>Если функция <i>f(x)</i> имеет первообразную на &Delta;, <i>k</i> &isin; <i>\R</i>, то функция <i>kf(x)</i> также имеет на &Delta; первообразную, и при <i>k</i> &ne; 0:<br />
<div class="outline-text-5" id="text-2-1-3-4">
\begin{gather*}
\int k&f(x)&dx=\{k&F(x)&+C\}\text{, }k\int&f(x)&dx=k\{&F(x)&+C\}
\end{gather*}

<p>
Т.к. <i>C</i> – произвольная постоянная и <i>k</i> &ne; 0, то множества {<i>kF(x)</i> + <i>C</i>} и <i>k/{/F(x)</i> + <i>C</i>} совпадают.
</p>
</div>
</li>
</ol>
</div>


<div id="outline-container-orgf6e665a" class="outline-4">
<h4 id="orgf6e665a"><span class="section-number-4">2.1.4</span> След. 1 (Линейность интеграла)</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
Если f1 и f2 имеют первообразные на ∆ ,
λ1 , λ2 ∈ R , λ
2
1 + λ
2
2 &gt; 0, то функция λ1f1 + λ2f2 имеет первообразную на ∆ , причем
Z
(λ1f1(x) + λ2f2(x))dx = λ1
Z
f1(x)dx + λ2
Z
f2(x)dx. (7)
Доказательство вытекает из свойств 3
o и 4
o
.
</p>
</div>
</div>
</div>


<div id="outline-container-orgcdeba72" class="outline-3">
<h3 id="orgcdeba72"><span class="section-number-3">2.2</span> Определенный интеграл Римана (определение). Ограниченность интегрируемых функций (с доказательством). Верхние и нижние суммы Дарбу (определения). Верхний и нижний интегралы Дарбу (определения). Критерий Дарбу. Интегрируемость непрерывных функций. Интегрируемость монотонных функций.</h3>
</div>

<div id="outline-container-org207082f" class="outline-3">
<h3 id="org207082f"><span class="section-number-3">2.3</span> Свойства определенного интеграла (сформулировать все, доказать непрерывность интеграла по верхнему пределу). Интегральная теорема о среднем.</h3>
</div>

<div id="outline-container-org3c51d49" class="outline-3">
<h3 id="org3c51d49"><span class="section-number-3">2.4</span> Теорема о дифференцировании интеграла по верхнему пределу (с доказательством).  Теорема о существовании первообразной (с доказательством). Формула Ньютона-Лейбница (с доказательством). Формула замены переменной в определенном интеграле. Формула интегрирования по частям.</h3>
</div>

<div id="outline-container-orgb64c6bc" class="outline-3">
<h3 id="orgb64c6bc"><span class="section-number-3">2.5</span> Определение несобственных интегралов.  Формула Ньютона-Лейбница и формула замены переменной для несобственных интегралов.</h3>
</div>

<div id="outline-container-org8a13bff" class="outline-3">
<h3 id="org8a13bff"><span class="section-number-3">2.6</span> Несобственные интегралы от неотрицательных функций (лемма и признак сравнения). Критерий Коши сходимости интеграла (с доказательством). Абсолютно сходящиеся интегралы (определение и теорема о сходимости абсолютно сходящегося интеграла).</h3>
</div>

<div id="outline-container-orgc7174f2" class="outline-3">
<h3 id="orgc7174f2"><span class="section-number-3">2.7</span> Определение числового ряда. Необходимый признак сходимости ряда (с доказательством). Критерий Коши сходимости ряда (с доказательством). Ряды с неотрицательными членами (признак сравнения, интегральный признак Коши, радикальный признак Коши, признак Даламбера).</h3>
</div>

<div id="outline-container-org8d93aaf" class="outline-3">
<h3 id="org8d93aaf"><span class="section-number-3">2.8</span> Знакопеременные ряды (признак Лейбница). Абсолютно сходящиеся ряды (определение). Критерий Коши абсолютной сходимости ряда. Условно сходящиеся ряды (определение). Теорема Римана.</h3>
</div>

<div id="outline-container-orgcc1fb16" class="outline-3">
<h3 id="orgcc1fb16"><span class="section-number-3">2.9</span> Функциональные последовательности  и ряды (определения, в том числе, ограниченная последовательность, сходящаяся последовательность, сходящийся ряд, абсолютно сходящийся ряд). Равномерная сходимость функциональной последовательности и функционального ряда (определение и пример). Критерии Коши равномерной сходимости функциональной последовательности (ряда). Признак Вейерштрасса.</h3>
</div>

<div id="outline-container-org9978bf4" class="outline-3">
<h3 id="org9978bf4"><span class="section-number-3">2.10</span> Свойства равномерно сходящихся рядов (непрерывность суммы (с доказательством), интегрирование, дифференцирование).</h3>
</div>
