math/teory.tex
\item Если функция \emph{F(x)} дифференцируема на \(\Delta\), то
\label{sec:org2fa1adb}

\begin{eqnarray}
\int d&F(x)&=&F(x)&+C \text{ или } \int&F'(x)&dx=&F(x)&+C
\end{eqnarray}

\item Пусть функция \emph{f(x)} имеет первообразную на \(\Delta\). Тогда для любого \emph{x} \(\in\) \(\Delta\) имеет место равенство:
\label{sec:orge844e26}

\begin{eqnarray}
d\int&f(x)&=&f(x)&dx
\end{eqnarray}

\item Если функции \emph{f\textsubscript{1}}, \emph{f\textsubscript{2}} имеют первообразные на \(\Delta\), то функция \emph{f\textsubscript{1}} + \emph{f\textsubscript{2}} имеет первообразную на \(\Delta\), причем:
\label{sec:org69b57fa}

\begin{eqnarray}
\int(&f_1(x)& + &f_2(x)&)dx=\int&f_1(x)&dx + \int&f_2(x)&dx
\end{eqnarray}

\item Если функция \emph{f(x)} имеет первообразную на \(\Delta\), \emph{k} \(\in\) \emph{\R}, то функция \emph{kf(x)} также имеет на \(\Delta\) первообразную, и при \emph{k} \(\ne\) 0:
\label{sec:org05f76a3}

\begin{gather*}
\int k&f(x)&dx=\{k&F(x)&+C\}\text{, }k\int&f(x)&dx=k\{&F(x)&+C\}
\end{gather*}

Т.к. \emph{C} – произвольная постоянная и \emph{k} \(\ne\) 0, то множества \{\emph{kF(x)} + \emph{C}\} и \emph{k/\{/F(x)} + \emph{C}\} совпадают.
\end{enumerate}


\subsubsection{След. 1 (Линейность интеграла)}
\label{sec:org4f2e7ef}
Если f1 и f2 имеют первообразные на ∆ ,
λ1 , λ2 ∈ R , λ
2
1 + λ
2
2 > 0, то функция λ1f1 + λ2f2 имеет первообразную на ∆ , причем
Z
(λ1f1(x) + λ2f2(x))dx = λ1
Z
f1(x)dx + λ2
Z
f2(x)dx. (7)
Доказательство вытекает из свойств 3
o и 4
o
.


\subsection{Определенный интеграл Римана (определение). Ограниченность интегрируемых функций (с доказательством). Верхние и нижние суммы Дарбу (определения). Верхний и нижний интегралы Дарбу (определения). Критерий Дарбу. Интегрируемость непрерывных функций. Интегрируемость монотонных функций.}
\label{sec:org7afa9b8}

\subsection{Свойства определенного интеграла (сформулировать все, доказать непрерывность интеграла по верхнему пределу). Интегральная теорема о среднем.}
\label{sec:org0824a8d}

\subsection{Теорема о дифференцировании интеграла по верхнему пределу (с доказательством).  Теорема о существовании первообразной (с доказательством). Формула Ньютона-Лейбница (с доказательством). Формула замены переменной в определенном интеграле. Формула интегрирования по частям.}
\label{sec:orgd469d7a}

\subsection{Определение несобственных интегралов.  Формула Ньютона-Лейбница и формула замены переменной для несобственных интегралов.}
\label{sec:org37b9713}

\subsection{Несобственные интегралы от неотрицательных функций (лемма и признак сравнения). Критерий Коши сходимости интеграла (с доказательством). Абсолютно сходящиеся интегралы (определение и теорема о сходимости абсолютно сходящегося интеграла).}
\label{sec:org1b78401}

\subsection{Определение числового ряда. Необходимый признак сходимости ряда (с доказательством). Критерий Коши сходимости ряда (с доказательством). Ряды с неотрицательными членами (признак сравнения, интегральный признак Коши, радикальный признак Коши, признак Даламбера).}
\label{sec:orgbe84ba0}

\subsection{Знакопеременные ряды (признак Лейбница). Абсолютно сходящиеся ряды (определение). Критерий Коши абсолютной сходимости ряда. Условно сходящиеся ряды (определение). Теорема Римана.}
\label{sec:orgfba1645}

\subsection{Функциональные последовательности  и ряды (определения, в том числе, ограниченная последовательность, сходящаяся последовательность, сходящийся ряд, абсолютно сходящийся ряд). Равномерная сходимость функциональной последовательности и функционального ряда (определение и пример). Критерии Коши равномерной сходимости функциональной последовательности (ряда). Признак Вейерштрасса.}
\label{sec:orga0b6e05}

\subsection{Свойства равномерно сходящихся рядов (непрерывность суммы (с доказательством), интегрирование, дифференцирование).}
\label{sec:org1477dab}
