math/teory.org
** Степенные ряды (определение). Первая теорема Абеля (с доказательством). Радиус и круг (интервал) сходимости степенного ряда (определения). Понятие аналитической функции (определение). Теорема о представлении аналитической функции рядом Тейлора. 

** Определение n-мерного арифметического евклидова пространства. Определение n-мерного открытого шара. Предел последовательности в n-мерном пространстве, ограниченное множество  в n-мерном пространстве, окрестность бесконечно удалённой точки (определения).

** Внутренняя точка множества, открытое множество, точка прикосновения множества, предельная точка множества, замыкание множества, замкнутое множество, компактное множество, линейно связное множество, выпуклое множество, область (определения).
