math/teory.html

<div id="outline-container-org0502349" class="outline-3">
<h3 id="org0502349"><span class="section-number-3">2.11</span> Степенные ряды (определение). Первая теорема Абеля (с доказательством). Радиус и круг (интервал) сходимости степенного ряда (определения). Понятие аналитической функции (определение). Теорема о представлении аналитической функции рядом Тейлора.</h3>
</div>

<div id="outline-container-orgbdd57b5" class="outline-3">
<h3 id="orgbdd57b5"><span class="section-number-3">2.12</span> Определение n-мерного арифметического евклидова пространства. Определение n-мерного открытого шара. Предел последовательности в n-мерном пространстве, ограниченное множество  в n-мерном пространстве, окрестность бесконечно удалённой точки (определения).</h3>
</div>

<div id="outline-container-org1769065" class="outline-3">
<h3 id="org1769065"><span class="section-number-3">2.13</span> Внутренняя точка множества, открытое множество, точка прикосновения множества, предельная точка множества, замыкание множества, замкнутое множество, компактное множество, линейно связное множество, выпуклое множество, область (определения).</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: q</p>
<p class="date">Created: 2021-06-18 Fri 22:23</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
